#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.deployments.time_sleep.wait_for_kubernetes: Refreshing state... [id=2022-08-23T17:04:46Z]
module.infrastructure.vcd_catalog.k8s_catalog: Refreshing state... [id=urn:vcloud:catalog:d5e6e627-8c1d-4d44-bd86-ddcb653393f8]
module.infrastructure.vcd_lb_app_profile.tcp: Refreshing state... [id=applicationProfile-1]
module.infrastructure.vcd_nsxv_firewall_rule.k8s_external: Refreshing state... [id=131077]
module.infrastructure.vcd_lb_service_monitor.k8s_tcp_monitor: Refreshing state... [id=monitor-4]
module.infrastructure.vcd_nsxv_firewall_rule.k8s_internal: Refreshing state... [id=131076]
module.infrastructure.data.vcd_edgegateway.k8s_gateway: Reading...
module.infrastructure.vcd_catalog_item.k8s_item: Refreshing state... [id=urn:vcloud:catalogitem:fb67091f-3b40-4ace-8d69-3da4b7031da6]
module.infrastructure.vcd_lb_server_pool.k8s_https_pool: Refreshing state... [id=pool-3]
module.infrastructure.vcd_lb_server_pool.k8s_http_pool: Refreshing state... [id=pool-2]
module.infrastructure.vcd_lb_server_pool.k8s_api_pool: Refreshing state... [id=pool-1]
module.infrastructure.data.vcd_edgegateway.k8s_gateway: Read complete after 6s [id=urn:vcloud:gateway:97fbc880-75c2-4c1e-8043-79282216f37d]
module.infrastructure.vcd_nsxv_snat.outbound: Refreshing state... [id=196610]
module.infrastructure.vcd_nsxv_dnat.bastion_ssh: Refreshing state... [id=196609]
module.infrastructure.vcd_nsxv_firewall_rule.k8s_bastion_ssh: Refreshing state... [id=131075]
module.infrastructure.vcd_edgegateway_settings.k8s_gateway: Refreshing state... [id=urn:vcloud:gateway:97fbc880-75c2-4c1e-8043-79282216f37d]
module.infrastructure.vcd_nsxv_firewall_rule.k8s_nodeports: Refreshing state... [id=131079]
module.infrastructure.vcd_nsxv_firewall_rule.k8s_web_ingress: Refreshing state... [id=131081]
module.infrastructure.vcd_nsxv_firewall_rule.k8s_apiserver: Refreshing state... [id=131080]
module.infrastructure.vcd_lb_virtual_server.k8s_https_vs: Refreshing state... [id=virtualServer-3]
module.infrastructure.vcd_lb_virtual_server.k8s_api_vs: Refreshing state... [id=virtualServer-1]
module.infrastructure.vcd_lb_virtual_server.k8s_http_vs: Refreshing state... [id=virtualServer-2]
module.infrastructure.vcd_network_routed_v2.k8s_network: Refreshing state... [id=urn:vcloud:network:654375d0-698c-40e2-aa0f-3fae859a8967]
module.infrastructure.vcd_vapp.k8s_vapp: Refreshing state... [id=urn:vcloud:vapp:503c9f80-7476-4739-a47f-bc2af1c1c442]
module.infrastructure.vcd_vapp_org_network.k8s_org_network: Refreshing state... [id=urn:vcloud:network:e1b6fae0-c161-4a68-a1e9-ccdea7351fd9]
module.infrastructure.vcd_vapp_vm.k8s_worker[0]: Refreshing state... [id=urn:vcloud:vm:15f10079-c063-4f75-b921-ef39170cce50]
module.infrastructure.vcd_vapp_vm.k8s_control_plane[2]: Refreshing state... [id=urn:vcloud:vm:4351d822-bac9-45ce-96ad-20377c1483c3]
module.infrastructure.vcd_vapp_vm.k8s_control_plane[0]: Refreshing state... [id=urn:vcloud:vm:5f3a631c-ebbe-4cc3-a9d7-34f0cbd3c3a0]
module.infrastructure.vcd_vapp_vm.k8s_bastion: Refreshing state... [id=urn:vcloud:vm:e0d5ebfe-209a-40f1-bc34-0251756cab39]
module.infrastructure.vcd_vapp_vm.k8s_worker[1]: Refreshing state... [id=urn:vcloud:vm:11220a74-daa8-4e38-a014-28baa988bd71]
module.infrastructure.vcd_vapp_vm.k8s_worker[2]: Refreshing state... [id=urn:vcloud:vm:cca86cf3-6848-4ce8-b33f-b0c1ef182c6a]
module.infrastructure.vcd_vapp_vm.k8s_control_plane[1]: Refreshing state... [id=urn:vcloud:vm:4b58baec-f012-465f-bc6d-4128c4a943e0]
module.kubernetes.module.k3s.random_password.k3s_cluster_secret: Refreshing state... [id=none]
module.kubernetes.module.k3s.tls_private_key.master_user[0]: Refreshing state... [id=0bea39de98ff1df9da7a821b31e407a8bbcc4abf]
module.kubernetes.module.k3s.tls_private_key.kubernetes_ca[0]: Refreshing state... [id=56a9343e74fca501c229b98d438a070b47e5ced5]
module.kubernetes.module.k3s.tls_private_key.kubernetes_ca[2]: Refreshing state... [id=d29577e3be57efb92f4bd23b476e4f367784dc7e]
module.kubernetes.module.k3s.tls_private_key.kubernetes_ca[1]: Refreshing state... [id=392e92d392455ef25b29d3354c75133ff85fb2a2]
module.kubernetes.module.k3s.tls_self_signed_cert.kubernetes_ca_certs["0"]: Refreshing state... [id=325924080811542979060082744667695320877]
module.kubernetes.module.k3s.tls_self_signed_cert.kubernetes_ca_certs["1"]: Refreshing state... [id=324819520252986128105762099930621042365]
module.kubernetes.module.k3s.tls_cert_request.master_user[0]: Refreshing state... [id=366963b54fb409b0880c3a2de92ee95747626c1d]
module.kubernetes.module.k3s.tls_self_signed_cert.kubernetes_ca_certs["2"]: Refreshing state... [id=192437048543817901966863044402355418584]
module.kubernetes.module.k3s.tls_locally_signed_cert.master_user[0]: Refreshing state... [id=294493198260383793914470039107331816007]
module.kubernetes.module.k3s.null_resource.k8s_ca_certificates_install[5]: Refreshing state... [id=1818970780335793850]
module.kubernetes.module.k3s.null_resource.k8s_ca_certificates_install[2]: Refreshing state... [id=7908746536178481058]
module.kubernetes.module.k3s.null_resource.k8s_ca_certificates_install[3]: Refreshing state... [id=7072204064630457938]
module.kubernetes.module.k3s.null_resource.k8s_ca_certificates_install[4]: Refreshing state... [id=6677916866281692562]
module.kubernetes.module.k3s.null_resource.k8s_ca_certificates_install[0]: Refreshing state... [id=7756294095733853102]
module.kubernetes.module.k3s.null_resource.k8s_ca_certificates_install[1]: Refreshing state... [id=3145304782044155793]
module.kubernetes.module.k3s.null_resource.servers_install["k8s-server-2"]: Refreshing state... [id=7909001610100334130]
module.kubernetes.module.k3s.null_resource.servers_install["k8s-server-0"]: Refreshing state... [id=6091854531256489432]
module.kubernetes.module.k3s.null_resource.servers_install["k8s-server-1"]: Refreshing state... [id=3331383733950103758]
module.kubernetes.local_sensitive_file.kubeconfig_file: Refreshing state... [id=19dcc65c6d208c396a31aa32167d725e922c99dd]
module.kubernetes.module.k3s.null_resource.servers_drain["k8s-server-0"]: Refreshing state... [id=2118590411352840356]
module.deployments.helm_release.longhorn: Refreshing state... [id=longhorn]
module.deployments.helm_release.ingress_nginx: Refreshing state... [id=ingress-controller]
module.kubernetes.module.k3s.null_resource.servers_drain["k8s-server-2"]: Refreshing state... [id=7536503069264173915]
module.kubernetes.module.k3s.null_resource.agents_install["k8s-worker-1"]: Refreshing state... [id=732595682870845389]
module.kubernetes.module.k3s.null_resource.servers_drain["k8s-server-1"]: Refreshing state... [id=925059063203998485]
module.kubernetes.module.k3s.null_resource.agents_install["k8s-worker-2"]: Refreshing state... [id=996158019085739776]
module.kubernetes.module.k3s.null_resource.agents_install["k8s-worker-0"]: Refreshing state... [id=2339423164637928357]
module.kubernetes.module.k3s.null_resource.servers_label["k8s-server-0|node.kubernetes.io/type"]: Refreshing state... [id=1088073248569600409]
module.kubernetes.module.k3s.null_resource.servers_label["k8s-server-1|node.kubernetes.io/type"]: Refreshing state... [id=7181834175093764150]
module.kubernetes.module.k3s.null_resource.servers_label["k8s-server-2|node.kubernetes.io/type"]: Refreshing state... [id=6058826824550211944]
module.deployments.data.kubectl_path_documents.hairpin_proxy: Reading...
module.kubernetes.module.k3s.null_resource.agents_label["k8s-worker-0|node.kubernetes.io/pool"]: Refreshing state... [id=260268090097057367]
module.kubernetes.module.k3s.null_resource.agents_drain["k8s-worker-1"]: Refreshing state... [id=2474345476462206723]
module.kubernetes.module.k3s.null_resource.agents_drain["k8s-worker-2"]: Refreshing state... [id=6125129281500053629]
module.deployments.data.kubectl_path_documents.hairpin_proxy: Read complete after 0s [id=d6417ac3c3707e9a66f386ca10af6f1a9c67360adb7646c4291e0bf688b43fbf]
module.kubernetes.module.k3s.null_resource.agents_label["k8s-worker-1|node.kubernetes.io/pool"]: Refreshing state... [id=4283649300796987503]
module.kubernetes.module.k3s.null_resource.agents_drain["k8s-worker-0"]: Refreshing state... [id=3464316758920057334]
module.kubernetes.module.k3s.null_resource.agents_label["k8s-worker-2|node.kubernetes.io/pool"]: Refreshing state... [id=7070946810565947281]
module.kubernetes.module.k3s.null_resource.kubernetes_ready: Refreshing state... [id=888671221457785043]
module.deployments.kubectl_manifest.hairpin_proxy["apiVersion: rbac.authorization.k8s.io/v1\nkind: ClusterRoleBinding\nmetadata:\n  name: hairpin-proxy-controller-crb\nroleRef:\n  apiGroup: rbac.authorization.k8s.io\n  kind: ClusterRole\n  name: hairpin-proxy-controller-cr\nsubjects:\n  - kind: ServiceAccount\n    name: hairpin-proxy-controller-sa\n    namespace: hairpin-proxy"]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/hairpin-proxy-controller-crb]
module.deployments.kubectl_manifest.hairpin_proxy["apiVersion: rbac.authorization.k8s.io/v1\nkind: Role\nmetadata:\n  name: hairpin-proxy-controller-r\n  namespace: kube-system\nrules:\n  - apiGroups: [\"\"]\n    resources:\n      - configmaps\n    resourceNames:\n      - coredns\n    verbs:\n      - get\n      - watch\n      - update"]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/namespaces/kube-system/roles/hairpin-proxy-controller-r]
module.deployments.kubectl_manifest.hairpin_proxy["apiVersion: v1\nkind: Service\nmetadata:\n  name: hairpin-proxy\n  namespace: hairpin-proxy\nspec:\n  selector:\n    app: hairpin-proxy-haproxy\n  ports:\n    - name: http\n      protocol: TCP\n      port: 80\n      targetPort: 80\n    - name: https\n      protocol: TCP\n      port: 443\n      targetPort: 443"]: Refreshing state... [id=/api/v1/namespaces/hairpin-proxy/services/hairpin-proxy]
module.deployments.kubectl_manifest.hairpin_proxy["apiVersion: v1\nkind: Namespace\nmetadata:\n  name: hairpin-proxy"]: Refreshing state... [id=/api/v1/namespaces/hairpin-proxy]
module.deployments.kubectl_manifest.hairpin_proxy["kind: ServiceAccount\napiVersion: v1\nmetadata:\n  name: hairpin-proxy-controller-sa\n  namespace: hairpin-proxy"]: Refreshing state... [id=/api/v1/namespaces/hairpin-proxy/serviceaccounts/hairpin-proxy-controller-sa]
module.deployments.kubectl_manifest.hairpin_proxy["apiVersion: apps/v1\nkind: Deployment\nmetadata:\n  labels:\n    app: hairpin-proxy-haproxy\n  name: hairpin-proxy-haproxy\n  namespace: hairpin-proxy\nspec:\n  replicas: 1\n  selector:\n    matchLabels:\n      app: hairpin-proxy-haproxy\n  template:\n    metadata:\n      labels:\n        app: hairpin-proxy-haproxy\n    spec:\n      containers:\n        - image: compumike/hairpin-proxy-haproxy:0.2.1\n          name: main\n          env:\n          - name: TARGET_SERVER\n            value: ingress-controller-ingress-nginx-controller.ingress-nginx.svc.cluster.local\n          resources:\n            requests:\n              memory: \"128Mi\"\n              cpu: \"25m\"\n            limits:\n              memory: \"256Mi\"\n              cpu: \"100m\""]: Refreshing state... [id=/apis/apps/v1/namespaces/hairpin-proxy/deployments/hairpin-proxy-haproxy]
module.deployments.kubectl_manifest.hairpin_proxy["apiVersion: apps/v1\nkind: Deployment\nmetadata:\n  labels:\n    app: hairpin-proxy-controller\n  name: hairpin-proxy-controller\n  namespace: hairpin-proxy\nspec:\n  replicas: 1\n  selector:\n    matchLabels:\n      app: hairpin-proxy-controller\n  template:\n    metadata:\n      labels:\n        app: hairpin-proxy-controller\n    spec:\n      serviceAccountName: hairpin-proxy-controller-sa\n      securityContext:\n        runAsUser: 405\n        runAsGroup: 65533\n      containers:\n        - image: compumike/hairpin-proxy-controller:0.2.1\n          name: main\n          resources:\n            requests:\n              memory: \"64Mi\"\n              cpu: \"25m\"\n            limits:\n              memory: \"128Mi\"\n              cpu: \"100m\""]: Refreshing state... [id=/apis/apps/v1/namespaces/hairpin-proxy/deployments/hairpin-proxy-controller]
module.deployments.kubectl_manifest.hairpin_proxy["apiVersion: rbac.authorization.k8s.io/v1\nkind: RoleBinding\nmetadata:\n  name: hairpin-proxy-controller-rb\n  namespace: kube-system\nroleRef:\n  apiGroup: rbac.authorization.k8s.io\n  kind: Role\n  name: hairpin-proxy-controller-r\nsubjects:\n  - kind: ServiceAccount\n    name: hairpin-proxy-controller-sa\n    namespace: hairpin-proxy"]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/namespaces/kube-system/rolebindings/hairpin-proxy-controller-rb]
module.deployments.kubectl_manifest.hairpin_proxy["kind: ClusterRole\napiVersion: rbac.authorization.k8s.io/v1\nmetadata:\n  name: hairpin-proxy-controller-cr\nrules:\n  - apiGroups:\n      - extensions\n      - networking.k8s.io\n    resources:\n      - ingresses\n    verbs:\n      - get\n      - list\n      - watch"]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/hairpin-proxy-controller-cr]
module.deployments.helm_release.cert_manager: Refreshing state... [id=cert-manager]
module.deployments.kubectl_manifest.cluster_issuer: Refreshing state... [id=/apis/cert-manager.io/v1/clusterissuers/lets-encrypt]
module.deployments.helm_release.prometheus[0]: Refreshing state... [id=prometheus]
module.deployments.helm_release.loki[0]: Refreshing state... [id=loki]
module.deployments.helm_release.kubernetes_dashboard: Refreshing state... [id=kubernetes-dashboard]
module.deployments.helm_release.promtail[0]: Refreshing state... [id=promtail]
module.deployments.helm_release.grafana[0]: Refreshing state... [id=grafana]
module.deployments.kubectl_manifest.kubernetes_dashboard_cluster_role_binding: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/kubernetes-dashboard]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.kubernetes.local_sensitive_file.kubeconfig_file has been deleted
  - resource "local_sensitive_file" "kubeconfig_file" {
      - content              = (sensitive value)
      - directory_permission = "0700" -> null
      - file_permission      = "0600" -> null
      - filename             = "kubeconfig" -> null
      - id                   = "19dcc65c6d208c396a31aa32167d725e922c99dd" -> null
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.deployments.helm_release.grafana[0] will be updated in-place
  ~ resource "helm_release" "grafana" {
        id                         = "grafana"
        name                       = "grafana"
      ~ version                    = "6.32.18" -> "6.33.1"
        # (27 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.deployments.helm_release.ingress_nginx will be updated in-place
  ~ resource "helm_release" "ingress_nginx" {
        id                         = "ingress-controller"
        name                       = "ingress-controller"
      ~ version                    = "4.2.1" -> "4.2.3"
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.deployments.helm_release.kubernetes_dashboard will be updated in-place
  ~ resource "helm_release" "kubernetes_dashboard" {
        id                         = "kubernetes-dashboard"
        name                       = "kubernetes-dashboard"
      ~ version                    = "5.8.0" -> "5.10.0"
        # (27 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.infrastructure.vcd_catalog_item.k8s_item must be replaced
-/+ resource "vcd_catalog_item" "k8s_item" {
      ~ created              = "2022-08-20T08:07:59.688Z" -> (known after apply)
      ~ id                   = "urn:vcloud:catalogitem:fb67091f-3b40-4ace-8d69-3da4b7031da6" -> (known after apply)
      - metadata             = {} -> null
        name                 = "kubernetes-demo_ubuntu_os_22.04"
      ~ ova_path             = "jammy-server-cloudimg-amd64.ova" -> "ubuntu-22.04-server-cloudimg-amd64.ova" # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.kubernetes.local_sensitive_file.kubeconfig_file will be created
  + resource "local_sensitive_file" "kubeconfig_file" {
      + content              = (sensitive value)
      + directory_permission = "0700"
      + file_permission      = "0600"
      + filename             = "kubeconfig"
      + id                   = (known after apply)
    }

  # module.kubernetes.module.k3s.data.http.k3s_installer will be read during apply
  # (config refers to values not yet known)
 <= data "http" "k3s_installer" {
      + body             = (known after apply)
      + id               = (known after apply)
      + response_headers = (known after apply)
      + url              = (known after apply)
    }

  # module.kubernetes.module.k3s.data.http.k3s_version will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "http" "k3s_version" {
      + body             = (known after apply)
      + id               = (known after apply)
      + response_headers = (known after apply)
      + url              = "https://update.k3s.io/v1-release/channels"
    }

  # module.kubernetes.module.k3s.null_resource.agents_install["k8s-worker-0"] must be replaced
-/+ resource "null_resource" "agents_install" {
      ~ id       = "2339423164637928357" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "on_new_version"       = "v1.24.3+k3s1" -> "v1.24.4+k3s1"
            # (1 unchanged element hidden)
        }
    }

  # module.kubernetes.module.k3s.null_resource.agents_install["k8s-worker-1"] must be replaced
-/+ resource "null_resource" "agents_install" {
      ~ id       = "732595682870845389" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "on_new_version"       = "v1.24.3+k3s1" -> "v1.24.4+k3s1"
            # (1 unchanged element hidden)
        }
    }

  # module.kubernetes.module.k3s.null_resource.agents_install["k8s-worker-2"] must be replaced
-/+ resource "null_resource" "agents_install" {
      ~ id       = "996158019085739776" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "on_new_version"       = "v1.24.3+k3s1" -> "v1.24.4+k3s1"
            # (1 unchanged element hidden)
        }
    }

  # module.kubernetes.module.k3s.null_resource.servers_install["k8s-server-0"] must be replaced
-/+ resource "null_resource" "servers_install" {
      ~ id       = "6091854531256489432" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "on_new_version"       = "v1.24.3+k3s1" -> "v1.24.4+k3s1"
            # (1 unchanged element hidden)
        }
    }

  # module.kubernetes.module.k3s.null_resource.servers_install["k8s-server-1"] must be replaced
-/+ resource "null_resource" "servers_install" {
      ~ id       = "3331383733950103758" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "on_new_version"       = "v1.24.3+k3s1" -> "v1.24.4+k3s1"
            # (1 unchanged element hidden)
        }
    }

  # module.kubernetes.module.k3s.null_resource.servers_install["k8s-server-2"] must be replaced
-/+ resource "null_resource" "servers_install" {
      ~ id       = "7909001610100334130" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "on_new_version"       = "v1.24.3+k3s1" -> "v1.24.4+k3s1"
            # (1 unchanged element hidden)
        }
    }

Plan: 8 to add, 3 to change, 7 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @JamesClonk, Action: `pull_request`, Working Directory: ``, Workflow: `Pull Request`*